// Напишите программу, которая по заданному номеру четверти, 
// показывает диапазон возможных координат точек в этой четверти (x и y).

// int Prompt(string message)

// {
//     Console.Write(message);
//     int num = int.Parse(Console.ReadLine());
//     return num;
// }
// int num1 = Prompt("введите четверть");
// GetResult(num1);
// void GetResult (int num1)
// {

//     if (num1 == 1)
//     {
//       Console.WriteLine("X>0, Y>0");
//     }
//     else if (num1 == 2)
//     {
//         Console.WriteLine("X<0, Y>0");
//     }
//     else if (num1 == 3)
//     {
//        Console.WriteLine("X<0, Y<0");
//     }
//     else if (num1 == 4)
//     {
//         Console.WriteLine("X>0, Y<0");
//     }
// }



// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

// A (3,6); B (2,1) -> 5,09 
// A (7,-5); B (1,-1) -> 7,21

// GetSquare();

// void GetSquare()
// {
//         Console.Write("x1 - ");
//         int x1 = int.Parse(Console.ReadLine());

//         Console.Write("y1 - ");
//         int y1 = int.Parse(Console.ReadLine());

//         Console.Write("x2 - ");
//         int x2 = int.Parse(Console.ReadLine());

//         Console.Write("y2 - ");
//         int y2 = int.Parse(Console.ReadLine());

//         double a = Math.Sqrt(Math.Pow(x2 - x1, 2) + Math.Pow(y2 - y1, 2));

//         Console.WriteLine(Math.Round(a,2));
// }


